syllabus-portfolio.org
#+TITLE:CS 306 Syllabus and Portfolio@@html:<br>@@ Spring 2019
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t d:(not "HINT")
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: theme-bigblow.setup

:HINT:
 Click your mouse on the link below, or with your cursor somewhere in it, press
 the Enter key.
 [[elisp:(browse-url-of-file%20(org-html-export-to-html))][Export to HTML and Browse]]
:END:

* What\rsquo{}s It All About?
  This course is about *algorithms and complexity*.

* Objectives
  - Become conversant with the topics and issues surrounding
    algorithms and complexity. These include (but are not limited to):
    - Basic algorithms analysis: Asymptotic analysis of upper and
      average complexity bounds;
    - Best, average, and worst case behaviors;
    - Big-Oh, little-Oh, Big-Omega, and Big-Theta notation;
    - Standard complexity classes;
    - Empirical measurements of performance; time and space tradeoffs
      in algorithms;
    - Using recurrence relations to analyze recursive algorithms;
    - Fundamental algorithmic strategies: brute-force; greedy; divide
      and conquer; decrease and conquer; backtracking;
    - Graph and tree algorithms: depth-and-breadth-first traversals;
      shortest-path (Dijkstra\rsquo{}s and Floyd\rsquo{}s algorithms); minimum
      spanning tree (Prim\rsquo{}s and Kruskal\rsquo{}s algorithms); topological
      sort.

  - Learn the techniques (i.e., acquire the "tools").
    - Analyze and compare algorithms using Big-Oh, Big-Omega, and
      Big-Theta.
    - Describe and implement in a high-level language (e.g., lisp)
      some or all of the following algorithmic techniques: Brute
      Force, Divide/Decrease/Transform-and-Conquer, Greedy, Dynamic
      Programming, Iterative Improvement and Backtracking.
* Prerequisites
  You must have successfully completed the following courses:

  - CS 235 Data Structures
  - CS 237 Discrete Mathematics I

  You must have *some* working knowledge of:

   - Procedural, Object-Oriented, and Functional Programming
   - Basic data structures (sets, lists, maps, trees, graphs, etc.)
   - Summation notation (\Sigma)
   - Recurrence relations
   - Limits
   - Logarithms
   - Matrices
* Requirements
  You are required to:
  + attend class each class period (but then again, why wouldn\rsquo{}t you?);
  + read assigned portions of the course materials /before/ the class meeting
    when they will be discussed;
  + complete weekly preparation assessments; and
  + do weekly homework assignments to deepen your understanding of selected
    topics.

** Required Text

   /Introduction to the Design and Analysis of Algorithms/

   *Anany Levitin*

   /Third Edition, 2012, Pearson/

   ISBN: 9780132316811

** Required Software
  To install these tools, see the instructions [[https://rickneff.github.io][here]] (and go to the /Tools/
  section).
  + git
  + Emacs/Spacemacs

** Required Behaviors
   You are required to:
  + attend class, as assessments will happen in class each day that are not
    reproducible outside of class;
  + read assigned portions of the course materials /before/ class meetings when
    they will be discussed;
  + complete all team and personal assessments to deepen your understanding of
    selected topics; and
  + acquire and maintain a three-ring binder that will hold your portfolio of
    completed work (see below).

* Course Periodicity
  This course has a weekly period, i.e., you can count on knowing ahead of time
  what you will be doing each day of each week. Each class period consists of three
  30-minute sections.

  On Mondays these sections are:

  - Presentation :: --- A time where I will add depth information to the preparation
                    material you finished reading *before class*.
  - Class Directed Learning :: --- You will participate in a class-wide activity that
       reinforces what you\rsquo{}ve read and what I\rsquo{}ve shown you.
  - Create and Explain Solutions to Exercises :: --- During this time period, as
       a team of between three and five classmates you will create a solution to
       an exercise. On completion of your exercise you, as an individual, will
       explain your solution to someone not on your team until they understand
       your solution. Further information on this will be given in class.

  On Wednesdays these sections are:

  - Answer Questions :: --- I will answer questions that have been submitted to
       the class Slack workspace (more on which later --- but for now please
       [[https://join.slack.com/t/cs306s19/shared_invite/enQtNTk3NDk0MTQ4MTc4LTk5YzdhY2M3YjQyMWJkZjgwYzNjMDBiZGMyMDU4MDI3Mzk1ODQ2OWI0MDk2NTBkYjM0ODRhMGNkMzVlOGE5Y2I][click here to join]]).
  - Class Directed Learning :: --- You will participate in a class-wide activity that
       reinforces what you\rsquo{}ve read and what I\rsquo{}ve shown you.
  - Work Problems :: --- This is in-class time for individual work on the
                     assignment for the week. Successful students will have
                     started working on these problems *before* this half-hour.
* Questions
  + The questions answered on Wednesday are generalized from those you submit via
    the slack channel on Tuesday Evenings.
  + You must submit any and all unanswered questions on Tuesday evening. Not
    submitting questions leads to a reduced learning experience.
  + You will have plenty of questions. Submit them! Choose knowledge over
    ignorance.
* Work
** Exercises
   Exercises are smaller experiences that are designed to float uncertainties and
   questions you have to the surface of your mind. They are designed to be smaller
   so you can find out what you don\rsquo{}t know and then take the steps necessary to
   know.

** Problems
   Problems are weightier experiences that invite you to explore topics in
   algorithms and complexity, as well as increase your algorithmic problem
   solving prowess. All involve writing mathematically.

** Late Work
   Late work is accepted /only if/ the reason is extraordinary, and acceptance is
   reached through private and prolonged negotiation. Also, you must come talk to
   me in person in my office --- *NOT* by email, nor any other means of
   communication.
