syllabus-portfolio.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-22 Mon 16:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CS 306 Syllabus and Portfolio<br> Spring 2019</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CS 306 Syllabus and Portfolio<br> Spring 2019</h1>

<div id="outline-container-org2aaf950" class="outline-2">
<h2 id="org2aaf950">What&rsquo;s It All About?</h2>
<div class="outline-text-2" id="text-org2aaf950">
<p>
This course is about <b>algorithms and complexity</b>.
</p>
</div>
</div>

<div id="outline-container-orgd45d531" class="outline-2">
<h2 id="orgd45d531">Objectives</h2>
<div class="outline-text-2" id="text-orgd45d531">
<ul class="org-ul">
<li>Become conversant with the topics and issues surrounding
algorithms and complexity. These include (but are not limited to):
<ul class="org-ul">
<li>Basic algorithms analysis: Asymptotic analysis of upper and
average complexity bounds;</li>
<li>Best, average, and worst case behaviors;</li>
<li>Big-Oh, little-Oh, Big-Omega, and Big-Theta notation;</li>
<li>Standard complexity classes;</li>
<li>Empirical measurements of performance; time and space tradeoffs
in algorithms;</li>
<li>Using recurrence relations to analyze recursive algorithms;</li>
<li>Fundamental algorithmic strategies: brute-force; greedy; divide
and conquer; decrease and conquer; backtracking;</li>
<li>Graph and tree algorithms: depth-and-breadth-first traversals;
shortest-path (Dijkstra&rsquo;s and Floyd&rsquo;s algorithms); minimum
spanning tree (Prim&rsquo;s and Kruskal&rsquo;s algorithms); topological
sort.</li>
</ul></li>

<li>Learn the techniques (i.e., acquire the &ldquo;tools&rdquo;).
<ul class="org-ul">
<li>Analyze and compare algorithms using Big-Oh, Big-Omega, and
Big-Theta.</li>
<li>Describe and implement in a high-level language (e.g., lisp)
some or all of the following algorithmic techniques: Brute
Force, Divide/Decrease/Transform-and-Conquer, Greedy, Dynamic
Programming, Iterative Improvement and Backtracking.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0b65093" class="outline-2">
<h2 id="org0b65093">Prerequisites</h2>
<div class="outline-text-2" id="text-org0b65093">
<p>
You must have successfully completed the following courses:
</p>

<ul class="org-ul">
<li>CS 235 Data Structures</li>
<li>CS 237 Discrete Mathematics I</li>
</ul>

<p>
You must have <b>some</b> working knowledge of:
</p>

<ul class="org-ul">
<li>Procedural, Object-Oriented, and Functional Programming</li>
<li>Basic data structures (sets, lists, maps, trees, graphs, etc.)</li>
<li>Summation notation (&Sigma;)</li>
<li>Recurrence relations</li>
<li>Limits</li>
<li>Logarithms</li>
<li>Matrices</li>
</ul>
</div>
</div>
<div id="outline-container-org59045d5" class="outline-2">
<h2 id="org59045d5">Requirements</h2>
<div class="outline-text-2" id="text-org59045d5">
<p>
You are required to:
</p>
<ul class="org-ul">
<li>attend class each class period (but then again, why wouldn&rsquo;t you?);</li>
<li>read assigned portions of the course materials <i>before</i> the class meeting
when they will be discussed;</li>
<li>complete weekly preparation assessments; and</li>
<li>do weekly homework assignments to deepen your understanding of selected
topics.</li>
</ul>
</div>

<div id="outline-container-org9194e47" class="outline-3">
<h3 id="org9194e47">Required Text</h3>
<div class="outline-text-3" id="text-org9194e47">
<p>
<i>Introduction to the Design and Analysis of Algorithms</i>
</p>

<p>
<b>Anany Levitin</b>
</p>

<p>
<i>Third Edition, 2012, Pearson</i>
</p>

<p>
ISBN: 9780132316811
</p>
</div>
</div>

<div id="outline-container-orge6fa324" class="outline-3">
<h3 id="orge6fa324">Required Software</h3>
<div class="outline-text-3" id="text-orge6fa324">
<p>
To install these tools, see the instructions <a href="https://rickneff.github.io">here</a> (and go to the <i>Tools</i>
section).
</p>
<ul class="org-ul">
<li>git</li>
<li>Emacs/Spacemacs</li>
</ul>
</div>
</div>

<div id="outline-container-org67c4d73" class="outline-3">
<h3 id="org67c4d73">Required Behaviors</h3>
<div class="outline-text-3" id="text-org67c4d73">
<p>
You are required to:
</p>
<ul class="org-ul">
<li>attend class, as assessments will happen in class each day that are not
reproducible outside of class;</li>
<li>read assigned portions of the course materials <i>before</i> class meetings when
they will be discussed;</li>
<li>complete all team and personal assessments to deepen your understanding of
selected topics; and</li>
<li>acquire and maintain a three-ring binder that will hold your portfolio of
completed work (see below).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org214addd" class="outline-2">
<h2 id="org214addd">Course Periodicity</h2>
<div class="outline-text-2" id="text-org214addd">
<p>
This course has a weekly period, i.e., you can count on knowing ahead of time
what you will be doing each day of each week. Each class period consists of three
30-minute sections.
</p>

<p>
On Mondays these sections are:
</p>

<dl class="org-dl">
<dt>Presentation</dt><dd>&#x2014; A time where I will add depth information to the preparation
material you finished reading <b>before class</b>.</dd>
<dt>Class Directed Learning</dt><dd>&#x2014; You will participate in a class-wide activity that
reinforces what you&rsquo;ve read and what I&rsquo;ve shown you.</dd>
<dt>Create and Explain Solutions to Exercises</dt><dd>&#x2014; During this time period, as
a team of between three and five classmates you will create a solution to
an exercise. On completion of your exercise you, as an individual, will
explain your solution to someone not on your team until they understand
your solution. Further information on this will be given in class.</dd>
</dl>

<p>
On Wednesdays these sections are:
</p>

<dl class="org-dl">
<dt>Answer Questions</dt><dd>&#x2014; I will answer questions that have been submitted to
the class Slack workspace (more on which later &#x2014; but for now please
<a href="https://join.slack.com/t/cs306s19/shared_invite/enQtNTk3NDk0MTQ4MTc4LTk5YzdhY2M3YjQyMWJkZjgwYzNjMDBiZGMyMDU4MDI3Mzk1ODQ2OWI0MDk2NTBkYjM0ODRhMGNkMzVlOGE5Y2I">click here to join</a>).</dd>
<dt>Class Directed Learning</dt><dd>&#x2014; You will participate in a class-wide activity that
reinforces what you&rsquo;ve read and what I&rsquo;ve shown you.</dd>
<dt>Work Problems</dt><dd>&#x2014; This is in-class time for individual work on the
assignment for the week. Successful students will have
started working on these problems <b>before</b> this half-hour.</dd>
</dl>
</div>
</div>
<div id="outline-container-org57c5984" class="outline-2">
<h2 id="org57c5984">Questions</h2>
<div class="outline-text-2" id="text-org57c5984">
<ul class="org-ul">
<li>The questions answered on Wednesday are generalized from those you submit via
the slack channel on Tuesday Evenings.</li>
<li>You must submit any and all unanswered questions on Tuesday evening. Not
submitting questions leads to a reduced learning experience.</li>
<li>You will have plenty of questions. Submit them! Choose knowledge over
ignorance.</li>
</ul>
</div>
</div>
<div id="outline-container-org7534555" class="outline-2">
<h2 id="org7534555">Work</h2>
<div class="outline-text-2" id="text-org7534555">
</div>
<div id="outline-container-orgef39aff" class="outline-3">
<h3 id="orgef39aff">Exercises</h3>
<div class="outline-text-3" id="text-orgef39aff">
<p>
Exercises are smaller experiences that are designed to float uncertainties and
questions you have to the surface of your mind. They are designed to be smaller
so you can find out what you don&rsquo;t know and then take the steps necessary to
know.
</p>
</div>
</div>

<div id="outline-container-org85b2c07" class="outline-3">
<h3 id="org85b2c07">Problems</h3>
<div class="outline-text-3" id="text-org85b2c07">
<p>
Problems are weightier experiences that invite you to explore topics in
algorithms and complexity, as well as increase your algorithmic problem
solving prowess. All involve writing mathematically.
</p>
</div>
</div>

<div id="outline-container-org4bbe9c9" class="outline-3">
<h3 id="org4bbe9c9">Late Work</h3>
<div class="outline-text-3" id="text-org4bbe9c9">
<p>
Late work is accepted <i>only if</i> the reason is extraordinary, and acceptance is
reached through private and prolonged negotiation. Also, you must come talk to
me in person in my office &#x2014; <b>NOT</b> by email, nor any other means of
communication.
</p>
</div>
</div>
</div>
