syllabus-portfolio.org
* Assessment
  About every four weeks you will meet with me in my office. The purpose of this
  meeting is for you to present your portfolio of work to me, make a grade-to-date
  claim, and provide evidence justifying that claim.

  Your portfolio *MUST* be a modified version of this file. All entries must
  follow the example format you will find at the end of this document (when it is
  updated). Also, your evidences must be complete and internally consistent. You
  are required to produce the portfolio using Spacemacs, export it as an HTML
  file (see how at the top of this file), and print it.
* Grades
  In each of our three personal meetings, you will present your portfolio and a
  letter-based grade-to-date claim. Afterwards I will give you my thoughts on the
  strength of your claim. The last claim that you make (not an average of the
  three), taking into account any feedback from me, will be your final grade for
  the course. All of your claims must must be evidence-based. That means you
  *MUST* bring the evidence with you, in your portfolio, that supports your claim.

** Letter-Based
   When making your claim, you are required to use the [[http://www.byui.edu/student-records/grades/grading-system][BYU-Idaho standard]]
   letter-based definition of grades, reproduced below:

   + \ldquo{}A\rdquo represents outstanding understanding, application, and integration of
     subject material and extensive evidence of original thinking, skillful use
     of concepts, and ability to analyze and solve complex problems.
     Demonstrates diligent application of Learning Model principles, including
     initiative in serving other students.
   + \ldquo{}B\rdquo represents considerable/significant understanding, application, and
     incorporation of the material that would prepare a student to be successful
     in next level courses, graduate school, or employment. The student
     participates in the Learning Model as applied in the course.
   + \ldquo{}C\rdquo represents sufficient understanding of subject matter. The student
     demonstrates minimal initiative to be prepared for class. Sequenced courses
     could be attempted, but mastering new materials might prove challenging.
     The student participates only marginally in the Learning Model.
   + \ldquo{}D\rdquo represents poor performance and initiative to learn and understand and
     apply course materials. Retaking a course or remediation may be necessary
     to prepare for additional instruction in this subject matter.
   + \ldquo{}F\rdquo represents failure in the course.

   Note that the above description of an \ldquo{}A\rdquo implies that you have gone *above and
   beyond*. To claim this grade you *must* have continually (not continuously) done
   one or both of the first two and one or both of the last two things listed below
   *each week* throughout the 4-week period, and you must also record evidence of
   these behaviors in your portfolio:
   1. teaching and/or helping others in the class but not in your group;
   2. teaching a Non-CS, Non-CE, Non-EE, Non-SE major about the material in this
      class to help them with a class they are taking;
   3. applying what you\rsquo{}ve learned in this class in another class you are
      currently taking; and
   4. doing work not assigned (such as puzzles --- see more on which later),
      exploring other topics in mathematics, writing code implementing what you
      are learning that has not been assigned, etc.

   Regarding the first two, quoting Truman Madsen (quoting the Prophet Joseph
   Smith): Now one of the strongest and wisest statements I have ever heard on
   egoism. The question was put to him, \ldquo{}Joseph, is the principle of
   self-aggrandizement wrong? Should we seek our own good?\rdquo Listen to his answer.
   \ldquo{}It is a correct principle and may be indulged upon only one rule or plan ---
   and that is to elevate, benefit, and bless others first. If you will elevate
   others, the very work itself will exalt you. Upon no other plan can a man justly
   and permanently aggrandize himself.\rdquo
* Legal
** Harassment
	 Title IX of the Education Amendments of 1972 prohibits sex discrimination
   against any participant in an education program or activity that receives
   federal funds, including Federal loans and grants. Title IX also covers
   student-to-student sexual harassment. If you encounter unlawful sexual
   harassment or gender based discrimination, please contact the Personnel Office
   at 208-496-1130.
** Disability
   Brigham Young University-Idaho is committed to providing a working and
   learning atmosphere which reasonably accommodates qualified persons with
   disabilities. If you have any disability which may impair your ability to
   complete this course successfully, please contact the Services for Students
   with Disabilities Office, 496-1158. Reasonable academic accommodations are
   reviewed for all students who have qualified documented disabilities. Services
   are coordinated with the student and instructor by this office. If you need
   assistance or if you feel you have been unlawfully discriminated against on
   the basis of disability, you may seek resolution through established grievance
   policy and procedures. You should contact the Personnel Office at 208-496-1130.
* Readings
  These readings are to be completed *before* each listed week\rsquo{}s Monday\rsquo{}s
  class.

  | Week | Reading from Textbook          |
  |------+--------------------------------|
  |   01 | Preface, Chapter 1, Appendix A |
  |   02 | Chapter 2, Appendix B          |
  |   03 | Chapter 3                      |
  |   04 | Chapter 4                      |
  |   05 | Chapter 5                      |
  |   06 | Chapter 6 sections 1-2         |
  |   07 | Chapter 6 sections 3, 5-6      |
  |   08 | Chapter 7                      |
  |   09 | Chapter 8                      |
  |   10 | Chapter 9                      |
  |   11 | Chapter 10                     |
  |   12 | Chapter 11                     |
  |   13 | Chapter 12                     |

* Portfolio
  Your portfolio consists of your Course Tracker together with Grade Claims and
  Evidences.
