syllabus-portfolio.html
<div id="outline-container-orgc4bd368" class="outline-2">
<h2 id="orgc4bd368">Assessment</h2>
<div class="outline-text-2" id="text-orgc4bd368">
<p>
About every four weeks you will meet with me in my office. The purpose of this
meeting is for you to present your portfolio of work to me, make a grade-to-date
claim, and provide evidence justifying that claim.
</p>

<p>
Your portfolio <b>MUST</b> be a modified version of this file. All entries must
follow the example format you will find at the end of this document (when it is
updated). Also, your evidences must be complete and internally consistent. You
are required to produce the portfolio using Spacemacs, export it as an HTML
file (see how at the top of this file), and print it.
</p>
</div>
</div>
<div id="outline-container-org4c2ebb7" class="outline-2">
<h2 id="org4c2ebb7">Grades</h2>
<div class="outline-text-2" id="text-org4c2ebb7">
<p>
In each of our three personal meetings, you will present your portfolio and a
letter-based grade-to-date claim. Afterwards I will give you my thoughts on the
strength of your claim. The last claim that you make (not an average of the
three), taking into account any feedback from me, will be your final grade for
the course. All of your claims must must be evidence-based. That means you
<b>MUST</b> bring the evidence with you, in your portfolio, that supports your claim.
</p>
</div>

<div id="outline-container-org8311e8c" class="outline-3">
<h3 id="org8311e8c">Letter-Based</h3>
<div class="outline-text-3" id="text-org8311e8c">
<p>
When making your claim, you are required to use the <a href="http://www.byui.edu/student-records/grades/grading-system">BYU-Idaho standard</a>
letter-based definition of grades, reproduced below:
</p>

<ul class="org-ul">
<li>&ldquo;A&rdquo; represents outstanding understanding, application, and integration of
subject material and extensive evidence of original thinking, skillful use
of concepts, and ability to analyze and solve complex problems.
Demonstrates diligent application of Learning Model principles, including
initiative in serving other students.</li>
<li>&ldquo;B&rdquo; represents considerable/significant understanding, application, and
incorporation of the material that would prepare a student to be successful
in next level courses, graduate school, or employment. The student
participates in the Learning Model as applied in the course.</li>
<li>&ldquo;C&rdquo; represents sufficient understanding of subject matter. The student
demonstrates minimal initiative to be prepared for class. Sequenced courses
could be attempted, but mastering new materials might prove challenging.
The student participates only marginally in the Learning Model.</li>
<li>&ldquo;D&rdquo; represents poor performance and initiative to learn and understand and
apply course materials. Retaking a course or remediation may be necessary
to prepare for additional instruction in this subject matter.</li>
<li>&ldquo;F&rdquo; represents failure in the course.</li>
</ul>

<p>
Note that the above description of an &ldquo;A&rdquo; implies that you have gone <b>above and
beyond</b>. To claim this grade you <b>must</b> have continually (not continuously) done
one or both of the first two and one or both of the last two things listed below
<b>each week</b> throughout the 4-week period, and you must also record evidence of
these behaviors in your portfolio:
</p>
<ol class="org-ol">
<li>teaching and/or helping others in the class but not in your group;</li>
<li>teaching a Non-CS, Non-CE, Non-EE, Non-SE major about the material in this
class to help them with a class they are taking;</li>
<li>applying what you&rsquo;ve learned in this class in another class you are
currently taking; and</li>
<li>doing work not assigned (such as puzzles &#x2014; see more on which later),
exploring other topics in mathematics, writing code implementing what you
are learning that has not been assigned, etc.</li>
</ol>

<p>
Regarding the first two, quoting Truman Madsen (quoting the Prophet Joseph
Smith): Now one of the strongest and wisest statements I have ever heard on
egoism. The question was put to him, &ldquo;Joseph, is the principle of
self-aggrandizement wrong? Should we seek our own good?&rdquo; Listen to his answer.
&ldquo;It is a correct principle and may be indulged upon only one rule or plan &#x2014;
and that is to elevate, benefit, and bless others first. If you will elevate
others, the very work itself will exalt you. Upon no other plan can a man justly
and permanently aggrandize himself.&rdquo;
</p>
</div>
</div>
</div>
<div id="outline-container-org50c088b" class="outline-2">
<h2 id="org50c088b">Legal</h2>
<div class="outline-text-2" id="text-org50c088b">
</div>
<div id="outline-container-org5680236" class="outline-3">
<h3 id="org5680236">Harassment</h3>
<div class="outline-text-3" id="text-org5680236">
<p>
Title IX of the Education Amendments of 1972 prohibits sex discrimination
against any participant in an education program or activity that receives
federal funds, including Federal loans and grants. Title IX also covers
student-to-student sexual harassment. If you encounter unlawful sexual
harassment or gender based discrimination, please contact the Personnel Office
at 208-496-1130.
</p>
</div>
</div>
<div id="outline-container-org0d479b9" class="outline-3">
<h3 id="org0d479b9">Disability</h3>
<div class="outline-text-3" id="text-org0d479b9">
<p>
Brigham Young University-Idaho is committed to providing a working and
learning atmosphere which reasonably accommodates qualified persons with
disabilities. If you have any disability which may impair your ability to
complete this course successfully, please contact the Services for Students
with Disabilities Office, 496-1158. Reasonable academic accommodations are
reviewed for all students who have qualified documented disabilities. Services
are coordinated with the student and instructor by this office. If you need
assistance or if you feel you have been unlawfully discriminated against on
the basis of disability, you may seek resolution through established grievance
policy and procedures. You should contact the Personnel Office at 208-496-1130.
</p>
</div>
</div>
</div>
<div id="outline-container-org272c437" class="outline-2">
<h2 id="org272c437">Readings</h2>
<div class="outline-text-2" id="text-org272c437">
<p>
These readings are to be completed <b>before</b> each listed week&rsquo;s Monday&rsquo;s
class.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Week</th>
<th scope="col" class="org-left">Reading from Textbook</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">01</td>
<td class="org-left">Preface, Chapter 1, Appendix A</td>
</tr>

<tr>
<td class="org-right">02</td>
<td class="org-left">Chapter 2, Appendix B</td>
</tr>

<tr>
<td class="org-right">03</td>
<td class="org-left">Chapter 3</td>
</tr>

<tr>
<td class="org-right">04</td>
<td class="org-left">Chapter 4</td>
</tr>

<tr>
<td class="org-right">05</td>
<td class="org-left">Chapter 5</td>
</tr>

<tr>
<td class="org-right">06</td>
<td class="org-left">Chapter 6 sections 1-2</td>
</tr>

<tr>
<td class="org-right">07</td>
<td class="org-left">Chapter 6 sections 3, 5-6</td>
</tr>

<tr>
<td class="org-right">08</td>
<td class="org-left">Chapter 7</td>
</tr>

<tr>
<td class="org-right">09</td>
<td class="org-left">Chapter 8</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Chapter 9</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">Chapter 10</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">Chapter 11</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">Chapter 12</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org981a8a3" class="outline-2">
<h2 id="org981a8a3">Portfolio</h2>
<div class="outline-text-2" id="text-org981a8a3">
<p>
Your portfolio consists of your Course Tracker together with Grade Claims and
Evidences.
</p>
</div>
