syllabus-portfolio.org
** Course Tracker Acronyms and Their Meanings
	+ CRU - I Completed the Reading and achieved a level of Understanding
          *before* the start of Monday\rsquo{}s class and recorded questions about the
          items I didn\rsquo{}t understand.
	+ PFP - I was present for and attentive to the presentation for this week.
	+ CDL - I fully participated in the Class Directed Learning for this day.
	+ SAQ - I, as the current representative of my team, submitted /at least 1/
    appropriate, Significant, Actual Question I have regarding the information
    for this week.
	+ PAQ - I was Present for and Attentive to the Answer Questions presentation for this week.
  + PPL - I, individually, correctly completed this Percentage of the Problems
    proving this Level of understanding before Monday at Midnight (for the
    previous week).
