syllabus-portfolio.html
<div id="outline-container-org29362fc" class="outline-3">
<h3 id="org29362fc">Course Tracker Acronyms and Their Meanings</h3>
<div class="outline-text-3" id="text-org29362fc">
<ul class="org-ul">
<li>CRU - I Completed the Reading and achieved a level of Understanding
<b>before</b> the start of Monday&rsquo;s class and recorded questions about the
items I didn&rsquo;t understand.</li>
<li>PFP - I was present for and attentive to the presentation for this week.</li>
<li>CDL - I fully participated in the Class Directed Learning for this day.</li>
<li>SAQ - I, as the current representative of my team, submitted <i>at least 1</i>
appropriate, Significant, Actual Question I have regarding the information
for this week.</li>
<li>PAQ - I was Present for and Attentive to the Answer Questions presentation for this week.</li>
<li>PPL - I, individually, correctly completed this Percentage of the Problems
proving this Level of understanding before Monday at Midnight (for the
previous week).</li>
</ul>
</div>
</div>
