syllabus-portfolio.org
** Course Tracker Tables
   You are required to track your progress in the course using the tables below.
   Currently, you see full credit for week 0\rsquo{}s work. (\checkmark means yes. Blank means
   no.) Update the table for week 1 and all subsequent weeks each class day and
   week during the semester.

@@latex:\pagebreak@@
| / |   <> | <>  | <>  | <>  | <>  | <>  | <>  | <>   |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # | Week | CRU | PFP | CDL | SAQ | PAQ | CDL | PPL  |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    0 | \check   | \check   | \check   | \check   | \check   | \check   | 100% |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    1 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    2 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    3 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    4 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|

  During week five, you will make your first claim by bringing this updated
  document to my office, where you will sign your name (in my presence) to the
  assertion below, and fill in your grade claim:

| / | <>                                                      | <>    | <>         |
|---+---------------------------------------------------------+-------+------------|
| # | The above table is an honest and true record of my work | Grade | Instructor |
| # | in this course for weeks one through four.              | Claim | Grade      |
|---+---------------------------------------------------------+-------+------------|
| # | Signed:                                                 |       |            |
| # |                                                         |       |            |
|---+---------------------------------------------------------+-------+------------|
@@html:<br /><br /><br />@@
@@latex:\pagebreak@@
| / |   <> | <>  | <>  | <>  | <>  | <>  | <>  | <>   |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # | Week | CRU | PFP | CDL | SAQ | PAQ | CDL | PPL  |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    5 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    6 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    7 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    8 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|

  During week nine, you will make your second claim by bringing this updated
  document to my office, where you will sign your name (in my presence) to the
  assertion below, and fill in your grade claim:

| / | <>                                                      | <>    | <>         |
|---+---------------------------------------------------------+-------+------------|
| # | The above table is an honest and true record of my work | Grade | Instructor |
| # | in this course for weeks five through eight.            | Claim | Grade      |
|---+---------------------------------------------------------+-------+------------|
| # | Signed:                                                 |       |            |
| # |                                                         |       |            |
|---+---------------------------------------------------------+-------+------------|
@@html:<br /><br /><br />@@
@@latex:\vspace{.5in}@@
| / |   <> | <>  | <>  | <>  | <>  | <>  | <>  | <>   |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # | Week | CRU | PFP | CDL | SAQ | PAQ | CDL | PPL  |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |    9 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |   10 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |   11 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |   12 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|
| # |   13 |     |     |     |     |     |     |      |
|---+------+-----+-----+-----+-----+-----+-----+------|

  During week fourteen, you will make your third and final claim by bringing this
  updated document to my office, where you will sign your name (in my presence) to
  the assertion below, and fill in your grade claim:

| / | <>                                                      | <>    | <>         |
|---+---------------------------------------------------------+-------+------------|
| # | The above table is an honest and true record of my work | Grade | Instructor |
| # | in this course for weeks nine through thirteen.         | Claim | Grade      |
|---+---------------------------------------------------------+-------+------------|
| # | Signed:                                                 |       |            |
| # |                                                         |       |            |
|---+---------------------------------------------------------+-------+------------|
@@html:<br /><br /><br />@@
@@latex:\pagebreak@@
