syllabus-portfolio.org
* Evidences
  Fill in your evidences here each week to build your portfolio. The number of
  pieces of evidence are determined by you. However, the more you have the
  better off you will be.

:HINT:
  There is an extra \lsquo{}x\rsquo on the front of the INCLUDE directives below. Delete the
  \lsquo{}x\rsquo when the assignment file is in place, and put it back if you do not want
  that week exported.
:END:

** Week 1
#+xINCLUDE: ./assignment-01.org :only-contents t :lines "6-"
** Week 2
#+xINCLUDE: ./assignment-02.org :only-contents t :lines "6-"
** Week 3
#+xINCLUDE: ./assignment-03.org :only-contents t :lines "6-"
** Week 4
#+xINCLUDE: ./assignment-04.org :only-contents t :lines "6-"
** Week 5
#+xINCLUDE: ./assignment-05.org :only-contents t :lines "6-"
** Week 6
#+xINCLUDE: ./assignment-06.org :only-contents t :lines "6-"
** Week 7
#+xINCLUDE: ./assignment-07.org :only-contents t :lines "6-"
** Week 8
#+xINCLUDE: ./assignment-08.org :only-contents t :lines "6-"
** Week 9
#+xINCLUDE: ./assignment-09.org :only-contents t :lines "6-"
** Week 10
#+xINCLUDE: ./assignment-10.org :only-contents t :lines "6-"
** Week 11
#+xINCLUDE: ./assignment-11.org :only-contents t :lines "6-"
** Week 12
#+xINCLUDE: ./assignment-12.org :only-contents t :lines "6-"
** Week 13
#+xINCLUDE: ./assignment-13.org :only-contents t :lines "6-"

@@latex:\pagebreak@@
* Other
  This document may be modified by the instructor at any time without
  notification.
